pa0694/IOC_SDMMC/STM32H7_SDMMC_FATFS.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=100000000
PD7.Mode=SD_4_bits_Wide_bus
ProjectManager.MainLocation=Core/Src
PH0-OSC_IN.Signal=RCC_OSC_IN
VP_SYS_VS_tim6.Mode=TIM6
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
RCC.CDCPREFreq_Value=275000000
RCC.SAI1Freq_Value=275000000
RCC.CortexFreq_Value=275000000
FREERTOS.BinarySemaphores01=myBinarySemAnalog,Dynamic,NULL
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H7A3ZITx
FATFS0.BSP.semaphore=
FATFS0.BSP.api=Unknown
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings=0xC0000000
NVIC.TIM6_DAC_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
VP_FATFS_VS_SDIO.Mode=SDIO
PG2.Signal=GPIO_Output
PC12.Locked=true
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_buffering_strategy=Double
PC12.Signal=GPIO_Output
PG2.Locked=true
PG3.GPIOParameters=GPIO_Label
RCC.PLLFRACN=0
PD3.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_CRC_Init-CRC-false-HAL-true,4-MX_UART5_Init-UART5-false-HAL-true,5-MX_USART10_UART_Init-USART10-false-HAL-true,6-MX_TIM17_Init-TIM17-false-HAL-true,7-MX_SDMMC2_SD_Init-SDMMC2-false-HAL-true,8-MX_FATFS_Init-FATFS-false-HAL-false,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
RCC.RTCFreq_Value=32000
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_FULL_ACCESS
RCC.CpuClockFreq_Value=275000000
RCC.VCO2OutputFreq_Value=200000000
PC13.GPIO_Label=PC13
PB13.Signal=UART5_TX
PG10.GPIO_PuPd=GPIO_NOPULL
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_location=By Address
PG2.GPIOParameters=PinState,GPIO_Label
PinOutPanel.RotationAngle=0
PG11.Signal=SDMMC2_D2
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
ProjectManager.StackSize=0x1000
RCC.AHB4Freq_Value=275000000
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
NVIC.UART5_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.VCOInput3Freq_Value=12500000
RCC.LPTIM1Freq_Value=137500000
Mcu.IP4=FREERTOS
Mcu.IP5=NVIC
RCC.SAI2BFreq_Value=275000000
PD11.GPIO_PuPd=GPIO_PULLUP
Mcu.IP2=DEBUG
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Mcu.IP3=FATFS
Mcu.IP0=CORTEX_M7
Mcu.IP1=CRC
USART10.ClockPrescaler=PRESCALER_DIV1
Mcu.UserConstants=
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
RCC.DIVP3Freq_Value=275000000
RCC.SDMMCFreq_Value=200000000
SDMMC2.IPParameters=ClockDiv
PD7.GPIO_PuPd=GPIO_NOPULL
Mcu.ThirdPartyNb=1
PG11.GPIO_PuPd=GPIO_NOPULL
PD11.GPIO_Label=LCD_INT
RCC.HCLKFreq_Value=275000000
RCC.I2C4Freq_Value=137500000
PE2.Mode=Asynchronous
Mcu.IPNb=11
ProjectManager.PreviousToolchain=STM32CubeIDE
RCC.SPDIFRXFreq_Value=275000000
RCC.DIVQ3Freq_Value=275000000
Mcu.Pin6=PH1-OSC_OUT
Mcu.Pin7=PB12
Mcu.Pin8=PB13
Mcu.Pin9=PB14
FREERTOS.IPParameters=Tasks01,BinarySemaphores01,configTOTAL_HEAP_SIZE
PH0-OSC_IN.Mode=HSE-External-Oscillator
FATFS0.BSP.ip=GPIO
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC13
Mcu.Pin3=PC14-OSC32_IN
Mcu.Pin4=PC15-OSC32_OUT
NVIC.EXTI15_10_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
Mcu.Pin5=PH0-OSC_IN
ProjectManager.ProjectBuild=false
RCC.DIVR3Freq_Value=27500000
RCC.HSE_VALUE=25000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB3.Mode=JTAG_5_pins
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_SIZE_128MB
FATFS0.BSP.i2caddr=0
RCC.DIVM3=2
Mcu.IP10=USART10
RCC.DIVM2=2
PA15.Mode=JTAG_5_pins
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
RCC.DIVM1=2
RCC.DFSDM2Freq_Value=137500000
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.21
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_CACHEABLE
Mcu.ThirdParty0=STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1
RCC.DIVP1Freq_Value=275000000
PB4.Mode=JTAG_5_pins
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=200000000
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PG12.GPIOParameters=GPIO_PuPd
PA14.Mode=JTAG_5_pins
RCC.DFSDM2ACLkFreq_Value=137500000
PB14.Mode=SD_4_bits_Wide_bus
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_display_interface=disp_ltdc
RCC.USART16Freq_Value=100000000
File.Version=6
NVIC.USART10_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
PE3.GPIOParameters=GPIO_PuPd
PE2.Signal=USART10_RX
SH.GPXTI11.ConfNb=1
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
RCC.PLL2_VCO_SEL-AdvancedSettings=RCC_PLL2VCOMEDIUM
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_SIZE_16MB
RCC.DIVR2Freq_Value=200000000
USART10.VirtualMode-Asynchronous=VM_ASYNC
ProjectManager.HalAssertFull=false
FREERTOS.configTOTAL_HEAP_SIZE=32768
RCC.DIVP2Freq_Value=100000000
PD11.GPIO_ModeDefaultEXTI=GPIO_MODE_IT_FALLING
ProjectManager.ProjectName=STM32H7_SDMMC_FATFS
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
RCC.APB3Freq_Value=137500000
PH1-OSC_OUT.Mode=HSE-External-Oscillator
RCC.MCO2PinFreq_Value=275000000
Mcu.Package=LQFP144
PB14.GPIO_PuPd=GPIO_NOPULL
PB12.Mode=Asynchronous
NVIC.TimeBase=TIM6_DAC_IRQn
SH.GPXTI11.0=GPIO_EXTI11
RCC.PLL3FRACN=0
PD11.Locked=true
RCC.SDMMC1CLockSelection=RCC_SDMMCCLKSOURCE_PLL2
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings=0x90000000
FATFS0.BSP.solution=PD3
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.ApplicationCcGraphicsJjApplication=TouchGFXOoGenerator
ProjectManager.ToolChainLocation=
NVIC.TimeBaseIP=TIM6
PA15.Signal=DEBUG_JTDI
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings=0xC0000000
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.GraphicsJjApplication_Checked=false
RCC.DFSDMFreq_Value=137500000
RCC.DIVR1Freq_Value=275000000
PB14.GPIOParameters=GPIO_PuPd
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_SIZE_1GB
RCC.TraceFreq_Value=275000000
RCC.APB4Freq_Value=137500000
PG12.GPIO_PuPd=GPIO_NOPULL
RCC.CECFreq_Value=32000
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region1_Settings=MPU_REGION_ENABLE
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.LPUART1Freq_Value=137500000
PD3.GPIO_Label=SDMMC2_DETECT
PB13.Mode=Asynchronous
PD6.Signal=SDMMC2_CK
USART10.TxPinLevelInvertParam=ADVFEATURE_TXINV_DISABLE
PE3.Mode=Asynchronous
RCC.SRDPPRE=RCC_APB4_DIV2
ProjectManager.CustomerFirmwarePackage=
RCC.SupplySource=PWR_LDO_SUPPLY
RCC.Tim2OutputFreq_Value=275000000
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_vsync=vsync_ltdc
RCC.DFSDMACLkFreq_Value=275000000
PB4.Signal=DEBUG_JTRST
RCC.VCO3OutputFreq_Value=550000000
PG2.GPIO_Label=LCD_DISP
PG12.Signal=SDMMC2_D3
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
FATFS0.BSP.STBoard=false
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_custom_height=480
ProjectManager.ProjectFileName=STM32H7_SDMMC_FATFS.ioc
CORTEX_M7.CPU_ICache=Enabled
FREERTOS.Tasks01=TouchGFXTask,24,4096,TouchGFX_Task,As weak,NULL,Dynamic,NULL,NULL;taskAnalogInput,24,128,StartTaskAnalogInput,Default,NULL,Dynamic,NULL,NULL;taskUSB,24,128,StartTaskUSB,Default,NULL,Dynamic,NULL,NULL
Mcu.PinsNb=29
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_address1=0xC0000000
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_address2=0xC0119400
ProjectManager.NoMain=false
PG3.Signal=GPIO_Output
PC13.Locked=true
NVIC.SavedSvcallIrqHandlerGenerated=true
PG3.Locked=true
PC13.Signal=GPIO_Output
FATFS0.BSP.mode=Input
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_ACCESS_BUFFERABLE
RCC.SWPMI1Freq_Value=137500000
PD3.Signal=GPIO_Input
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_ENABLE
PG10.Mode=SD_4_bits_Wide_bus
PD7.Signal=SDMMC2_CMD
ProjectManager.DefaultFWLocation=true
USART10.RxPinLevelInvertParam=ADVFEATURE_RXINV_DISABLE
ProjectManager.DeletePrevious=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=200000000
PD6.Mode=SD_4_bits_Wide_bus
CORTEX_M7.BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings=0x90000000
RCC.FamilyName=M
PG10.Signal=SDMMC2_D1
FATFS0.BSP.instance=PD3
RCC.SPI6Freq_Value=137500000
PC12.GPIOParameters=GPIO_Label
FATFS.IPParameters=_MAX_SS
PA13.Signal=DEBUG_JTMS-SWDIO
CORTEX_M7.MPU_Control=MPU_PRIVILEGED_DEFAULT
RCC.USART234578Freq_Value=100000000
RCC.SPI45Freq_Value=137500000
RCC.Tim1OutputFreq_Value=275000000
PG2.PinState=GPIO_PIN_SET
RCC.CDPPRE1=RCC_APB1_DIV2
RCC.CDPPRE2=RCC_APB2_DIV2
RCC.SPI123Freq_Value=275000000
CORTEX_M7.IsBufferable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_ACCESS_BUFFERABLE
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.tgfx_hardware_accelerator=dma_2d
ProjectManager.TargetToolchain=STM32CubeIDE
RCC.VCO1OutputFreq_Value=550000000
FATFS0.BSP.condition=
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1.IPParameters=tgfx_display_interface,tgfx_vsync,tgfx_hardware_accelerator,tgfx_custom_height,tgfx_location,tgfx_address1,tgfx_address2,tgfx_buffering_strategy,ApplicationCcGraphicsJjApplication
STMicroelectronics.X-CUBE-TOUCHGFX.4.16.1_SwParameter=ApplicationCcGraphicsJjApplication\:TouchGFXOoGenerator;
USART10.FIFOMode=FIFOMODE_DISABLE
RCC.DIVN3=44
RCC.AXIClockFreq_Value=275000000
RCC.DIVN2=16
RCC.DIVN1=44
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
PE2.GPIOParameters=GPIO_PuPd
PG10.GPIOParameters=GPIO_PuPd
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
RCC.CKPERFreq_Value=64000000
PB14.Signal=SDMMC2_D0
FATFS.BSP.number=1
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
PE2.GPIO_PuPd=GPIO_PULLUP
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_REGION_ENABLE
board=custom
PG12.Mode=SD_4_bits_Wide_bus
ProjectManager.LastFirmware=true
PD11.GPIOParameters=GPIO_PuPd,GPIO_Label,GPIO_ModeDefaultEXTI
RCC.VCOInput1Freq_Value=12500000
VP_SYS_VS_tim6.Signal=SYS_VS_tim6
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.AHB12Freq_Value=275000000
RCC.APB2Freq_Value=137500000
USART10.BaudRate=38400
MxCube.Version=6.2.1
RCC.FMCCLockSelection=RCC_FMCCLKSOURCE_PLL2
PC13.GPIOParameters=GPIO_Label
RCC.FDCANFreq_Value=275000000
FATFS0.BSP.i2creg=
RCC.RNGFreq_Value=48000000
RCC.ADCFreq_Value=100000000
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PE3.GPIO_PuPd=GPIO_PULLUP
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.CDPPRE=RCC_APB3_DIV2
PA13.Mode=JTAG_5_pins
ProjectManager.FreePins=false
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CDCPREFreq_Value,CDPPRE,CDPPRE1,CDPPRE2,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,DFSDM2ACLkFreq_Value,DFSDM2Freq_Value,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVM3,DIVN1,DIVN2,DIVN3,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2,DIVR2Freq_Value,DIVR3,DIVR3Freq_Value,FDCANFreq_Value,FMCCLockSelection,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2_VCO_SEL-AdvancedSettings,PLL3FRACN,PLLFRACN,PLLSourceVirtual,QSPICLockSelection,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI2AFreq_Value,SAI2BFreq_Value,SDMMC1CLockSelection,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SRDPPRE,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,SupplySource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16CLockSelection,USART16Freq_Value,USART234578CLockSelection,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H7A3Z(G-I)Tx
RCC.LPTIM2Freq_Value=137500000
Mcu.Pin26=VP_FATFS_VS_SDIO
SDMMC2.ClockDiv=8
Mcu.Pin27=VP_FREERTOS_VS_CMSIS_V2
NVIC.SavedPendsvIrqHandlerGenerated=true
Mcu.Pin24=PB4
USART10.MSBFirstParam=ADVFEATURE_MSBFIRST_DISABLE
ProjectManager.UnderRoot=true
Mcu.Pin25=VP_CRC_VS_CRC
CORTEX_M7.IPParameters=MPU_Control,CPU_ICache,CPU_DCache,Enable-Cortex_Memory_Protection_Unit_Region1_Settings,Enable-Cortex_Memory_Protection_Unit_Region2_Settings,Enable-Cortex_Memory_Protection_Unit_Region3_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region1_Settings,Size-Cortex_Memory_Protection_Unit_Region1_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region1_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region2_Settings,Size-Cortex_Memory_Protection_Unit_Region2_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region2_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region2_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region3_Settings,Size-Cortex_Memory_Protection_Unit_Region3_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region3_Settings,Enable-Cortex_Memory_Protection_Unit_Region4_Settings,BaseAddress-Cortex_Memory_Protection_Unit_Region4_Settings,Size-Cortex_Memory_Protection_Unit_Region4_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region4_Settings,IsCacheable-Cortex_Memory_Protection_Unit_Region4_Settings,IsBufferable-Cortex_Memory_Protection_Unit_Region4_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings,AccessPermission-Cortex_Memory_Protection_Unit_Region2_Settings,DisableExec-Cortex_Memory_Protection_Unit_Region2_Settings
FATFS._MAX_SS=4096
Mcu.IP8=SYS
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=UART5
Mcu.Pin28=VP_SYS_VS_tim6
Mcu.IP6=RCC
Mcu.IP7=SDMMC2
ProjectManager.CoupleFile=false
PB3.Signal=DEBUG_JTDO-SWO
RCC.SYSCLKFreq_VALUE=275000000
Mcu.Pin22=PG12
NVIC.SDMMC2_IRQn=true\:5\:0\:false\:false\:true\:true\:true\:true
RCC.I2C123Freq_Value=137500000
Mcu.Pin23=PB3
Mcu.Pin20=PG10
Mcu.Pin21=PG11
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=true
PD11.Signal=GPXTI11
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PC12.GPIO_Label=USB_DP_PULL_UP
ProjectManager.CompilerOptimize=6
RCC.QSPICLockSelection=RCC_OSPICLKSOURCE_PLL2
PG11.Mode=SD_4_bits_Wide_bus
PA14.Signal=DEBUG_JTCK-SWCLK
ProjectManager.HeapSize=0x1000
Mcu.Pin15=PA15
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PC12
Mcu.Pin13=PA13
Mcu.Pin14=PA14
CORTEX_M7.Enable-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_ENABLE
Mcu.Pin19=PD7
CORTEX_M7.Size-Cortex_Memory_Protection_Unit_Region3_Settings=MPU_REGION_SIZE_512MB
RCC.LPTIM345Freq_Value=137500000
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PD3
Mcu.Pin18=PD6
CORTEX_M7.DisableExec-Cortex_Memory_Protection_Unit_Region2_Settings=MPU_INSTRUCTION_ACCESS_DISABLE
RCC.LTDCFreq_Value=27500000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
RCC.USART234578CLockSelection=RCC_USART234578CLKSOURCE_PLL2
Mcu.Pin11=PG2
Mcu.Pin12=PG3
FATFS0.BSP.component=
Mcu.Pin10=PD11
RCC.DIVQ1Freq_Value=275000000
PE3.Signal=USART10_TX
CORTEX_M7.CPU_DCache=Enabled
PG3.GPIO_Label=CMD_BUZ_EXT
RCC.HCLK3ClockFreq_Value=275000000
RCC.DIVR3=20
RCC.VCOInput2Freq_Value=12500000
RCC.APB1Freq_Value=137500000
RCC.DIVR2=1
USART10.IPParameters=VirtualMode-Asynchronous,RxPinLevelInvertParam,TxPinLevelInvertParam,MSBFirstParam,ClockPrescaler,FIFOMode,BaudRate
VP_CRC_VS_CRC.Mode=CRC_Activate
CORTEX_M7.AccessPermission-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_REGION_FULL_ACCESS
RCC.SAI2AFreq_Value=275000000
ProjectManager.DeviceId=STM32H7A3ZITx
RCC.USART16CLockSelection=RCC_USART16910CLKSOURCE_PLL2
PB12.Signal=UART5_RX
PD7.GPIOParameters=GPIO_PuPd
FATFS0.BSP.name=Detect_SDIO
ProjectManager.LibraryCopy=1
PG11.GPIOParameters=GPIO_PuPd
CORTEX_M7.IsCacheable-Cortex_Memory_Protection_Unit_Region4_Settings=MPU_ACCESS_CACHEABLE
isbadioc=false
